[["Who can participate in the Open Contest?", 
"Everyone who loves coding can participate in the contest."], 
["What programming languages are allowed for coding in Open Contest?", 
"Contestants can code in any of the 52 major programming languages including C, C++, C#, Java, PHP, VB.Net, Python, Perl, Ruby, JS, Objective C, Go, Scala, F#, Haskell, Lua, D, Clojure, Groovy, TCL, Pascal, Ocaml, Erlang, Small Talk, Cobol, Racket, Bash, Java 8, Python 3, GNU Octave, Rust, Common LISP, R and Node JS.,How can I participate in the contest?,Register for the contest by completing the registration form. (Click here)"],
["How long will the contest last for?", 
"The Open Contest will be conducted in three rounds: open-round, semi-finals and finale. Top contestants who score maximum in open-round will qualify for the semi-final round, Further Top 300 semi-finalists will make it to the finale to be held offline in Mumbai."],
["Will I see my score immediately?", 
"Yes, once you submit the code; you will see the score on the result page."], 
["How will I receive the next round confirmation?", 
"We will send you an e-mail to confirm next-round or you can check the status on user dashboard."], 
["I have participated in the contest, when will be the leaderboard get updated with my latest score?", 
"Top Rankers is updated hourly. Your rank and score will be updated when we update the leaderboard."], 
["What kind of questions are asked?", 
"Code Gladiators 2018 is open to coders in 52 programming languages and question will be algorithmic in nature. Candidates are expected to solve problems of varying difficulties. You can take your pick from C, C++, C#, Java, PHP, VB.Net, Python, Perl, Ruby, JS, Objective C, Go, Scala, F#, Haskell, Lua, D, Clojure, Groovy, TCL, Pascal, Ocaml, Erlang, Small Talk, Cobol, Racket, Bash, Java 8, Python 3, GNU Octave, Rust, Common LISP, R and Node JS."], 
["How will I gauge my performance in the contest?", 
"You can check your score after every attempt on the Dashboard or Top Rankers. However, we will keep you posted about the same via emails."], 
["My code runs perfectly on local system but it is giving error on Code Gladiators 2018 platform. Why?", 
"Please use given input/output types, functions as asked in the Coding problem description. Also follow the input/output specification and check the variable type to ensure that your code run fine on our platform."], 
["I was attempting a coding problem and was about to submit but the timer got over. Can I get time extension to submit my code?", 
"No additional time will be provided. Every coding question has a stipulated time in which you have to complete and submit your solution."], 
["I was attempting a coding problem, but due to some unavoidable reason, I have to close the system/browser. Can I come back later and complete the coding problem?", 
"Yes, you can come back later and re-attempt the problem. The timer will continue from the time where you have left. Your attempt will be deducted only if you submit your code or if the timer gets over."], 
["I was attempting a coding problem, but suddenly my system/browser crashed and I need to restart. When I logged in to Code Gladiators 2018 and re-attempted my coding problem, I didn’t see the code which I had written so far before. Is there any way I can recover my lost code?", 
"No, you need to restart from the scratch. We only save the solution on submission."], 
["Can I get to see which of my test cases were incorrect in the Code Gladiators 2018 test?", 
"We do not disclose the detailed results of the challenge. Only the marks you accumulate in each question are shared and the ranking is dependent on the marks."], 
["Is there any negative marking for an incorrect solution?", 
"There is no negative marking for any coding question."], 
["I have attempted a problem. Can I improve my score?", 
"Yes, you can improve your score till you have attempts left in the question."], 
["I have attempted a question in a level twice, which score of mine will be considered and added in the leader board?", 
"The score which is highest in the contest will be considered and added in your leaderboard. Suppose you are participating in first question and you score 50 marks and 70 marks in your 2 different attempts. In this case 70 marks will be added to your final score in leader board."], 
["Who can participate in other contest?", 
"Anyone who loves to code and passionate about technology can participate in the contest."], 
["How can I participate in the contest?", 
"Register for the contest by completing the registration form. (Click here)"], 
["What kind of questions are asked in screening round?", 
"MCQ based questions will be asked to check the understanding of the area followed by hackathon rounds."], 
["How many attempts will I get?", 
"All contestants get maximum two attempts in screening round."], 
["How will I gauge my performance in the contest?", 
"You can check your score and your team’s score after every attempt on the Top Rankers. However, we will keep you posted about the same via emails."], 
["How long will the contest last for?", 
"Contest will be having three round.,Screening Round,Online Hackathon,Offline Hackathon"], 
["How I will be able to create team?", 
"Once you clear the screening round then only top rankers in the particular area will be able to create team, rest can only join the already created teams."], 
["Is there any limit on team members?",
"Yes, you can have only 1-3 members in the team."], 
["How do I submit what I have made for the Hackathon?", 
"You have to develop the application on your local system and submit it on submission page in tar/zip file format along with detailed presentation and source code., The entire idea need not be fully implemented however, the submission should be functional so that it can be reviewed by the judges."], 
["If it is a team submission, does that mean all team members will have access to work at the same time?", 
"Yes, all team members can login from their account and do application submission on it."], 
["How can I edit my profile?", 
"To edit your profile, you need to click on your name displayed on top right corner of the page. You will get a drop down which will have link to ‘Profile’ Page. Click on the ‘Profile’ link to open the profile page."], 
["I cannot enter my full e-mail id in the login box, what should I do?",
"The login box accepts email id as long as 200 characters. If you continue to face an issue, then please clear your browser cache."], 
["My password is not getting accepted, what is the limitation of password field?", 
"Your password should be minimum of 6 and maximum of 16 characters. If your password is not getting accepted than use the 'Forgot password' link to set a new password."], 
["How to start participating in the contest?", 
"You need to register on the website by submitting the Registration Form Once you login, you will be redirected to the Dashboard where you can find the link to participate in the contest."], 
["I already have a TechGig account, do I need to register again for Code Gladiators 2018?", 
"No, you don’t need to register for Code Gladiators 2018. You can use your TechGig credentials to login."], 
["Can I participate as an open candidate if my company is participating?", 
"Yes, you can participate through your personal email id."], 
["Which compilers are used to compile different languages source code?", 
"Language \tVersion, c \tgcc 4.9.2, c++ \tg++ 4.9.2, c# \tMono C# compiler 3.2.8 .NET 4.0 CLR"], 
["What is a Compilation Log?", 
"Any compilation error or warning will be displayed on compilation log."], 
["What does default test case status matrix display?", 
"KEY \tEXPLANATION, Input Values \tDefault arguments passed to function, Candidate Ouput \tOutput returned by function,Expected Output \tExpected output returned by function,Time(sec) \tExecution time taken by testcase,Testcase status \tTrue/False/CE/RE/TLE/MLE,Status Details \tStatus description"], 
["What does default test case status matrix display?", 
"KEY \tExplanation,Input Values \tDefault arguments passed to function,Candidate Ouput \tOutput returned by function,KEY \tExplanation,Testcase status \tTrue/False/CE/RE/TLE/MLE,Status Details \tStatus description"], 
["Legends", 
"'True - Testcase success', \n'False - Testcase failure', \n'CE - Compilation Error', \n'RE - Runtime Error', \n'TLE - Time Limit Exceeded', \n'MLE - Memory Limit Exceeded'"], 
["What are source code restrictions for a code?", 
"Source code length is restricted to 25,000 bytes in a one file. Additional restrictions may be applicable depending on the question. Use of external libraries or files is prohibited."], 
["What are Execution time restrictions for a code?", 
"Execution time is restricted for each problem and for each test case separately. All test cases are tested on TechGig server either by hardware or compiler."], 
["What are the Input/Output specifications of coding problems?", 
"We use problem specific input/output specifications. These will be provided with problem statement."], 
["How does TechGig engine determine whether the code is correct?", 
"TechGig engine automatically tests your code. For each test case, the returned value from your function must match the expected output *exactly* in order to evaluate your marks."], 
["How do I test my program on local machine?", 
"Testing your function in exactly the same way that our online TechGig engine does. Create a source code file and define a method as you write on TechGig platform and then run your program from the command line. For example: Candidate Code on Techgig Code Editor: #include #include int squareCount(int input1[]) { //Write code here return 1; } Create a new source code file as Candidate Code.c and write the code written below- #include #include int squareCount(int input1[]) {//Write code here return 10;} int main(int argc, char *a[]) {int input1={1,2,3}; int output=squareCount(input1); printf('%d',output); return 1; } Now You can test this code with same compiler and version used by CodeGauge Engine (see Compilers and their Versions) as follows gcc CandidateCode.c ./a.out"], 
["How does the time limit work for test cases?", 
"Your code must read, process, and output the result for all test cases within the specified time limit."], 
["How does the total execution time work?", 
"Your code is tested against different test cases. The execution time displayed is the total of the time spent for each test case except default test case. But your program is terminated if it exceeds the time limit mentioned in the problem while processing any test case. Hence, Total execution time"], 
["How does the total memory consumed work?", 
"Total memory consumed by the program is sum of the memory consumed by program in stack, data, heap, and bss."], 
["Why do I get Time Limit Exceeded (TLE)?", 
"We normally let your code run until it is finished (or the time limit is exceeded). Execution time limit is restricted for each problem and for each test case separately."], 
["Why do I get NA in default test case status matrix?", 
"If your code has some compile time error, you will get NA in the. default test case status matrix."], 
["Can I view others solutions?", 
"No, you cant."]]
